{
  "_name_or_path": "bert-base-multilingual-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "shop_rent",
    "1": "shop_sale",
    "2": "office_rent",
    "3": "industrial",
    "4": "apartment_rent",
    "5": "apartment_sale",
    "6": "villa_rent",
    "7": "villa_sale",
    "8": "land"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "apartment_rent": 4,
    "apartment_sale": 5,
    "industrial": 3,
    "land": 8,
    "office_rent": 2,
    "shop_rent": 0,
    "shop_sale": 1,
    "villa_rent": 6,
    "villa_sale": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
